# Taps
tap "fluxcd/tap"

# DevOps
brew "bazelisk"

# Kubernetes
brew "kubernetes-cli"
brew "stern"
brew "k9s"
brew "helm"
brew "kubecm"
brew "kubectx"
brew "kubelogin"
brew "kubeseal"
brew "argocd"
brew "grpcurl"
brew "awscli-local"
brew "fluxcd/tap/flux"

# Work Apps
cask "mattermost"
cask "microsoft-edge"
cask "microsoft-teams"
cask "microsoft-office"
