# Programming Languages
brew "node"
brew "go"
brew "rust"

# Development Tools
brew "prettier"
brew "eslint"
brew "git-lfs"

# Neovim
brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "fd"

# Databases
brew "sqlc"

# CLI Utilities
brew "bat"
brew "eza"
brew "tlrc"
brew "jq"
brew "yq"
brew "xq"
brew "watch"
brew "wget"
brew "btop"
brew "gh"
brew "tree"

# Shell
brew "starship"
brew "fzf"
brew "zoxide"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"

# Essential Apps
cask "brave-browser"
cask "appcleaner"
cask "docker-desktop"
cask "ghostty"
cask "keepassxc"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "stats"
