# Taps
tap "teamookla/speedtest"
tap "codecrafters-io/tap"
tap "FelixKratz/formulae"
tap "fluxcd/tap"

# Programming Languages
brew "git"
brew "mise"
brew "node"
brew "go"
brew "ruby"
brew "python"
brew "java"
brew "rustup"

# Development Tools
brew "codecrafters"
brew "hugo"
brew "prettier"
brew "eslint"
brew "rust-analyzer"
brew "cmake"

# Neovim
brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "fd"

# DevOps
brew "ansible"
brew "terraform"
brew "bazelisk"
brew "lazydocker"

# Kubernetes
brew "kubernetes-cli"
brew "stern"
brew "k9s"
brew "helm"
brew "kubecm"
brew "kubectx"
brew "argocd"
brew "fluxcd/tap/flux"

# Databases
brew "mysql"
brew "postgresql"
brew "sqlite"
brew "sqlc"

# CLI Utilities
brew "bat"
brew "eza"
brew "tlrc"
brew "rsync"
brew "ffmpeg"
brew "imagemagick"
brew "jq"
brew "yq"
brew "xq"
brew "watch"
brew "wget"
brew "btop"
brew "yt-dlp"
brew "teamookla/speedtest/speedtest"
brew "gh"
brew "mas"
brew "fastfetch"
brew "tree"

# Shell
brew "powerlevel10k"
brew "fzf"
brew "zoxide"

# Yazi File Manager
brew "yazi"
brew "ffmpegthumbnailer"
brew "sevenzip"
brew "poppler"

# macOS Utilities
brew "sketchybar"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-caskaydia-cove-nerd-font"

# Essential Apps
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "appcleaner"
cask "docker-desktop"
cask "ghostty"
cask "keepassxc"
cask "rectangle"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "github"

# Personal Apps
cask "obs"
cask "raspberry-pi-imager"
cask "obsidian"
cask "google-drive"
cask "vlc"
cask "minecraft"
cask "ledger-wallet"
cask "discord"
cask "teamviewer"
cask "affinity-photo"
cask "jdownloader"
cask "godot"

# Work Apps
# cask "mattermost"
# cask "microsoft-edge"
# cask "microsoft-teams"
# cask "microsoft-office"

# Mac App Store
# mas "Xcode", id: 497799835
# mas "Final Cut Pro", id: 424389933
# mas "Amphetamine", id: 937984704
# mas "BetterSnapTool", id: 417375580
# mas "Kindle", id: 302584613
# mas "Wireguard", id: 1451685025

# Manual Installs
# epson software https://www.epson.de/de_DE/support/sc/epson-workforce-es-50/s/s1684
