# tap

tap "teamookla/speedtest"
tap "fluxcd/tap"
tap "codecrafters-io/tap"

# brew

## Dev

brew "git"

brew "mise"

brew "node"
brew "go"
brew "ruby"
brew "python"
brew "java"
brew "rust"

brew "codecrafters"
brew "hugo"
brew "prettier"
brew "eslint"

### Raylib

brew "raylib"
brew "cmake"

### Neovim

brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "fd"

## Ops

brew "ansible"
brew "terraform"
brew "lazydocker"

### SQL

brew "mysql"
brew "postgresql"
brew "sqlite"
brew "sqlc"

### Kubernetes

brew "kubernetes-cli"
brew "stern"
brew "k9s"
brew "helm"
brew "kubecm"
brew "kubectx"
brew "kubeseal"
brew "argocd"
brew "fluxcd/tap/flux"

## Utilities

brew "tlrc"
brew "rsync"
brew "ffmpeg"
brew "imagemagick"
brew "jq"
brew "yq"
brew "watch"
brew "wget"
brew "btop"
brew "yt-dlp"
brew "teamookla/speedtest/speedtest"
brew "gh"

brew "mas"

### Yazi

brew "yazi"

brew "ffmpegthumbnailer"
brew "sevenzip"
brew "poppler"
brew "fzf"
brew "zoxide"

### Nonsense

brew "sl"
brew "neofetch"
brew "circumflex"

# cask

cask "font-fira-code-nerd-font"

## Must-have

cask "google-chrome"
cask "appcleaner"
cask "docker"
cask "iterm2"
cask "keepassxc"
cask "rectangle"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "github"

## Personal

cask "obs"
cask "raspberry-pi-imager"
cask "obsidian"
cask "google-drive"
cask "vlc"
cask "minecraft"
cask "ledger-live"
cask "discord"
cask "teamviewer"
cask "affinity-photo"
cask "jdownloader"

# mas

mas "Xcode", id: 497799835
mas "Final Cut Pro", id: 424389933
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "Kindle", id: 302584613
mas "Wireguard", id: 1451685025


# manual
# epson software https://www.epson.de/de_DE/support/sc/epson-workforce-es-50/s/s1684

