catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
danielgjackson.auto-dark-mode-windows
dbaeumer.vscode-eslint
docker.docker
esbenp.prettier-vscode
github.copilot-chat
golang.go
mikestead.dotenv
tamasfe.even-better-toml
shd101wyy.markdown-preview-enhanced