# tap

# brew

## Pentesting

brew "nmap"
brew "tcpdump"

brew "sqlmap"

brew "ffuf"
brew "gobuster"

brew "john"
brew "hashcat"
brew "hydra"

brew "netcat"
brew "powershell"

brew "kubectl"
brew "awscli"

## Dev

brew "git"

brew "node"
brew "go"
brew "ruby"
brew "python"
brew "java"
brew "rust"

brew "prettier"
brew "eslint"

### Neovim

brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "fd"

## Utilities

brew "tlrc"
brew "jq"
brew "yq"
brew "watch"
brew "wget"
brew "btop"
brew "gh"

brew "mas"

### Yazi

brew "yazi"

brew "ffmpegthumbnailer"
brew "sevenzip"
brew "poppler"
brew "fzf"
brew "zoxide"

### Nonsense

brew "neofetch"

# cask

cask "font-fira-code-nerd-font"

## Must-have

cask "google-chrome"
cask "iterm2"
cask "the-unarchiver"
cask "visual-studio-code"

## Pentesting

cask "burp-suite"
